cask_args appdir: "/Applications"
# formulae
tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
# browsers
cask "google-chrome"
cask "vivaldi"
cask "firefox"
# development
cask "sublime-text"
cask "iterm2"
cask "arduino"
cask "filezilla"
brew "mosquitto"
brew "python"
brew "speedtest-cli"
brew "asciinema"
brew "git"
brew "tig"
brew "tmux"
brew "openssl"
brew "tree"
brew "yarn"
brew "npm"
brew "fish"
brew "mas"
brew "wget"
brew "shellcheck"
brew "ssh-copy-id"
# utilities
cask "flux"
cask "google-backup-and-sync"
cask "the-unarchiver"
cask "puush"
cask "spectacle"
cask "android-file-transfer"
cask "ccleaner"
brew "lastpass-cli", args: ["with-pinentry"]
# media/messaging/entertainment
cask "adobe-creative-cloud"
cask "slack"
cask "whatsapp"
cask "skype"
cask "vlc"
cask "spotify"
cask "transmission"
cask "calibre"
cask "imageoptim"
cask "steam"
brew "cmatrix"
brew "cowsay"
