cask_args appdir: "/Applications"
# formulae
#tap "caskroom/cask"
tap "homebrew/cask"
tap "homebrew/cask-versions"
#tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
# browsers
#cask "google-chrome"
cask "vivaldi"
cask "firefox"
# development
cask "sublime-text"
cask "iterm2"
cask "arduino"
brew "mosquitto"
brew "python"
brew "asciinema"
#brew "git"
brew "jq"
brew "tig"
brew "tmux"
brew "openssl"
brew "tree"
brew "fish"
brew "mas"
brew "wget"
brew "shellcheck"
brew "ngrok"
#brew "ssh-copy-id"
cask "jetbrains-toolbox"
cask "sourcetree"
brew "onefetch"
brew "neofetch"
# utilities
cask "ccleaner"
brew "bettertouchtool"
# media/messaging/entertainment
cask "adobe-creative-cloud"
cask "slack"
cask "whatsapp"
cask "vlc"
cask "spotify"
cask "imageoptim"
cask "steam"
